renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_config.c
    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_dtc_callback1() */

/**********************************************************************************************************************
* Outline      : SDHI SDIO Callback Processing
* Function Name: r_sdc_sdio_callback1
* Description  : Executes the callback function of SDIO interrupt.
* Arguments    : uint32_t           sdiosts             ;   SDIOSTS register value.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : For device no 1.
**********************************************************************************************************************/
static sdc_sd_status_t r_sdc_sdio_callback1(uint32_t sdiosts)
{
    sdc_sd_hndl_t   * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(SDC_SD_CARD_NO1);  /* Card No. 1 */

#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (0 == p_hndl)
    {
        return SDC_SD_ERR;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
    if (r_sdc_sdio_get_int(SDC_SD_CARD_NO1, sdiosts) == SDC_SD_SUCCESS)     /* Card No. 1 */
    {
        if (p_hndl->sdc_sd_int_io_callback)
        {
            (*p_hndl->sdc_sd_int_io_callback)(0);
        }
    }
#endif /* SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO */

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sdio_callback1() */

/**********************************************************************************************************************
* Outline      : Disable ICU
* Function Name: r_sdc_sd_disable_icu_int
* Description  : Disables the Interrupt Request Enable (IENn).
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_disable_icu_int(uint32_t card_no)
{
    sdc_sd_hndl_t * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_HWINT)
    if (R_SDHI_DisableIcuInt(p_hndl->channel, SDHI_HWINT_ACCESS_CD | SDHI_HWINT_BUFFER) != SDHI_SUCCESS)
#else
    if (R_SDHI_DisableIcuInt(p_hndl->channel, SDHI_HWINT_BUFFER) != SDHI_SUCCESS)
#endif /* SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_HWINT */
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_INT, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR);
        return SDC_SD_ERR;
    }
    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_disable_icu_int() */

/**********************************************************************************************************************
* Outline      : Enable ICU
* Function Name: r_sdc_sd_enable_icu_int
* Description  : Enables the Interrupt Request Enable (IENn).
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_enable_icu_int(uint32_t card_no)
{
    sdc_sd_hndl_t * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_HWINT)
    if (R_SDHI_EnableIcuInt(p_hndl->channel, SDHI_HWINT_ACCESS_CD | SDHI_HWINT_BUFFER) != SDHI_SUCCESS)
#else
    if (R_SDHI_EnableIcuInt(p_hndl->channel, SDHI_HWINT_BUFFER) != SDHI_SUCCESS)
#endif /* SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_HWINT */
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_INT, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR);
        return SDC_SD_ERR;
    }
    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_enable_icu_int() */

/**********************************************************************************************************************
* Outline      : Get initialization speed division of SDHI FIT module
* Function Name: r_sdc_sd_get_div_init_speed
* Description  : Gets initialization speed division of SDHI FIT module.
* Arguments    : None
* Return Value : Initialization speed division
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t r_sdc_sd_get_div_init_speed(void)
{
    return SDHI_CFG_DIV_INIT_SPEED;
} /* End of function r_sdc_sd_get_div_init_speed() */

/**********************************************************************************************************************
* Outline      : Get default speed division of SDHI FIT module
* Function Name: r_sdc_sd_get_div_default_speed
* Description  : Gets default speed division of SDHI FIT module.
* Arguments    : None
* Return Value : Default speed division
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t r_sdc_sd_get_div_default_speed(void)
{
    return SDHI_CFG_DIV_DEFAULT_SPEED;
} /* End of function r_sdc_sd_get_div_default_speed() */

/* End of File */
